"""
Задача №2.
Школа вирішила замінити парти у трьох кабінетах. Кожна парта розрахована на двох учнів. Враховуючи кількість учнів у кожному класі, надрукуйте найменшу можливу кількість парт,
які треба придбати. Програма повинна прочитати три цілих числа: кількість учнів в кожному з трьох класів a, b та c відповідно.


Автор: Жулід А А
"""
import math
student_a = int(input("Введіть кількість учнів А класу: "))
student_b = int(input("Введіть кількість учнів B класу: "))
student_c = int(input("Введіть кількість учнів C класу: "))
#Використаємо функцію math.ceil для округлення числа в більшу сторону, бо за партою також може сидіти 1 учень у випадках непарної кількості дітей
desk1 = math.ceil(student_a / 2) #кількість парт для A класу
desk2 = math.ceil(student_b / 2) #кількість парт для B класу
desk3 = math.ceil(student_c / 2) #кількість парт для C класу
amount = desk1+desk2+desk3
print(amount)

