"""
Задача №4.
Дано натуральне число. Знайти число, що отримується видаленням з вхідного усіх зазначених цифр.


Автор: Жулід А А
"""
num = int(input('Введіть число: '))
x = str(input('Введіть цифру для видалення: '))
num1 = str(num) #Переведемо число у рядковий тип, щоб видалити зайве
num2 = num1.replace(x, '') #Використаємо заміну числа на пропуск
num2 = int(num2) #Повернемо рядок у числовий формат
print(num2)

